<html>
	<head>
    	<title>Killer Game 2017</title>
		<meta name="viewport" content="width=device-width, initial-scale=1" /> 
		<link href="/style.css" rel="stylesheet" type="text/css">
        <link rel="apple-touch-icon" sizes="180x180" href="/favicon/apple-touch-icon.png?renew=true" />
        <link rel="icon" type="image/png" href="/favicon/favicon-32x32.png?renew=true" sizes="32x32" />
        <link rel="icon" type="image/png" href="/favicon/favicon-16x16.png?renew=true" sizes="16x16" />
        <link rel="manifest" href="/favicon/manifest.json?renew=true" />
        <link rel="mask-icon" href="/favicon/safari-pinned-tab.svg?renew=true" color="#e00000" />
        <link rel="shortcut icon" href="/favicon/favicon.ico?renew=true" />
        <meta name="msapplication-TileColor" content="#000000" />
        <meta name="msapplication-TileImage" content="/favicon/mstile-144x144.png?renew=true" />
        <meta name="msapplication-config" content="/favicon/browserconfig.xml?renew=true" />
        <meta name="theme-color" content="#000000" />
    </head>
    <body>
    	<div style="position: relative; display: inline-block; top: 0; left: 0; width: 100%; height: 100%; white-space: normal; overflow-x: hidden; overflow-y: scroll;">
        <div style="text-align: center; max-width: 100%;"><img src="/killergame.png" style="max-width: 100%;"/></div><br /><br />
    	Amministrazione del sito: Gianluca Brian.<br />
        Amministrazione del gioco: <i>Aspen Hartenbear</i>, Viviana Couto, Gianluca Brian.<br />
        (Per qualsiasi problema, scriveteci su Facebook)<br />
        <br />
        Il resto del sito &egrave; in inglese perch&eacute; mi va e fa pi&ugrave; stile "film americano figo" (?).<br />
        <br /><br /><br />
        <b>Regole del gioco:</b><br />
        Il gioco consiste nell'uccidere (possibilmente non sul serio) il proprio obiettivo colpendolo con l'arma assegnata.<br />
        <pre style="white-space: pre-wrap;">Esempio matematico:<br />
        Siano A, B, C tre giocatori e &alpha;, &beta; due armi. Allora, il giocatore A deve cercare di uccidere il giocatore B toccandolo con &alpha;, mentre il giocatore B deve cercare di uccidere il giocatore C toccandolo con &beta;.
        Se B dovesse morire prima di compiere l'uccisione, la sua arma e il suo obiettivo passerebbero ad A, che dunque dovr&agrave; cercare di uccidere C con l'arma &beta; (dunque, l'arma &egrave; associata all'obiettivo, non all'uccisore).
        Lo schema &egrave; dunque il seguente:
        A -&alpha;&rarr; B -&beta;&rarr; C;
        B muore;
        A -&beta;&rarr; C.</pre>
        A beneficio dello studio (e per avere delle "aree protette"), ci sono alcuni luoghi di immunit&agrave;:
        <ul>
        	<li>Non &egrave; consentito uccidere in <b>aula studio</b> (aula D);</li>
            <li>Non &egrave; consentito uccidere nel <b>centro di calcolo</b>;</li>
            <li>Non &egrave; consentito uccidere in <b>biblioteca</b>;</li>
            <li>Non &egrave; consentito uccidere in qualsiasi luogo che richiede l'accesso mediante tessera magnetica;</li>
            <li>L'uccisione nei laboratori sotterranei &egrave; limitata agli orari in cui <b>NON</b> c'&egrave; lezione;</li>
            <li>Non &egrave; consentito uccidere fuori dall'edificio Guido Castelnuovo (non si pu&ograve; uccidere oltre l'ultimo gradino. <b>N.B.</b>: le scale antiincendio dell'aula D possono essere luogo di uccisione.</li>
        </ul><br />
        <br /><br /><br />
        Infine, il funzionamento di questo sito: <br />
        Ad ogni giocatore &egrave; associato un codice personale che deve rimanere segreto fino al momento dell'uccisione. <br />
        Quando un giocatore uccide il suo obiettivo, quest'ultimo gli comunica il proprio codice, il nuovo obiettivo e la nuova arma e il giocatore pu&ograve; proseguire il gioco. <br />
        <pre style="white-space: pre-wrap;">Esempio (stavolta non troppo matematico perch&eacute; altrimenti potrei essere io la prossima vittima del gioco):<br />
        Alice ha il codice XYZ123 e ha come obiettivo Bob; Bob ha il codice UVW456 e ha come obiettivo Charlie.
        Quando Alice uccide Bob, questo le dice il suo prossimo obiettivo &egrave; Charlie e le fornisce il codice UVW456;
        dopodich&eacute;, Alice accede al sito <a href="https://binarystore.altervista.org/killergame.php">binarystore.altervista.org</a> (ovvero questo sito) e clicca sul pulsante "Kill Target".
        Nella finestra che compare, Alice scrive il codice UVW456 e clicca "ok", confermando cos&igrave; l'uccisione di Bob.
        </pre><br />
        <br /><br /><br />
        <b>IN ALTERNATIVA</b>, se il vostro smartphone &egrave; dotato di lettore di codici QR (il quadratino che vedete in fondo alla pagina), &egrave; possibile ottenere una morte pi&ugrave; istantanea ed indolore. <br />
        Baster&agrave; accedere alla propria pagina personale (cliccando sul pulsante "My page" e inserendo il <b>proprio</b> codice) e mostrare il codice QR al proprio uccisore: questo lo scansioner&agrave; con l'app adatta e potr&agrave; accedere ad una pagina che gli comunicher&agrave; l'avvenuta uccisione. <br />
        Infine, per chi non dovesse disporre di tale app ma volesse comunque usufruire del vantaggio dei codici QR, di seguito sono disponibili due servizi di lettura di codici QR online.<br /><br />
        <a href="https://webqr.com/">webqr.com</a><br />
        <a href="https://www.the-qrcode-generator.com/scan">www.the-qrcode-generator.com</a><br />
        <br /><br /><br />
        Buona fortuna e buona caccia!<br />
        <br />
        <br />
        <br />
        Riepilogo delle versioni precedenti: <br />
    	<ul>
        	<li><b>Versione 1.3.0 (b)</b>: <i>
            	<ul>
                	<li>Aggiunta la "pagina personale": &egrave; possibile accedere alla propria pagina cliccando sul pulsante "My page" ed inserendo il <b>proprio</b> codice;</li>
                    <li>Risolti alcuni bug minori.</li>
                </ul></i></li>
        	<li><b>Versione 1.2.1 (b)</b>: <i>
            	<ul>
                	<li>Il sito &egrave; ora "Web App capable": su Chrome per Android (e suppongo anche con altri browser e dispositivi), potete cliccare sui tre puntini verticali in alto a destra e poi su "Aggiungi a schermata Home"; in tal modo, avrete il Killer Game sempre a portata di mano!</li>
                    <li>Modificata la barra delle info generali in testo scorrevole contenente informazioni utili.</li>
                </ul></i></li>
        	<li><b>Versione 1.2.0 (b)</b>: <i>
            	<ul>
                	<li>Aggiunti controlli facilitati per gli amministratori (voi non li vedete ma per noi sono molto comodi);</li>
                    <li>Aggiunti i messaggi "Miglior giocatore vivo" e "miglior giocatore morto";</li>
                    <li>Aggiunta colonna armi per gli amministratori (voi non la vedete ma FINALMENTE possiamo tenere traccia delle armi);</li>
                    <li>Aggiunta pubblicit&agrave; (non odiatemi, non &egrave; invasiva e pu&ograve; contribuire al sostentamento di questo sito);</li>
                    <li>Risolto bug che mostrava <i>'Killed by "???"'</i> all'inserimento del codice di un giocatore gi&agrave; morto.</li>
                </ul></i></li>
        	<li><b>Versione 1.1.0 (b)</b>: <i>
            	<ul>
                	<li>Aggiunta la possibilit&agrave; di disattivare il sito per manutenzione;</li>
                    <li>Aggiunto il conteggio dei giocatori totali e dei giocatori rimanenti;</li>
                    <li>Aggiunta questa pagina di informazioni (probabilmente di dubbia utilit&agrave;).</li>
                </ul></i></li>
        	<li><b>Versione 1.0.0 (b)</b>: <i>Killer Game, versione on line (per una gestione migliore delle uccisioni). Attenzione: il sito &egrave; ancora in fase sperimentale e possono succedere cose impreviste!</i></li>
        </ul>
        <br />
        <a href='./index.php'>Torna indietro</a>.<br /><br /><br />
        Nuove funzionalit&agrave; in arrivo!<br /><br /><br />
        <div style="text-align: center; max-width: 100%;"><img src="https://chart.googleapis.com/chart?cht=qr&chs=330x330&chld=L|0&chl=Stiamo%20lavorando%20per%20voi%21" style="max-width: 100%;"/></div>
        </div>
    </body>
</html> 
